baruch_config.org

#+auto_tangle: t
test
* Minimum Usability

#+BEGIN_SRC emacs-lisp :tangle yes
  (set-fringe-mode '(25 . 25))
  (fset 'yes-or-no-p 'y-or-n-p)
                                          ;  (setq confirm-kill-emacs (quote y-or-n-p))
  (setq confirm-kill-emacs nil
        visible-bell nil
        inhibit-startup-screen t
        org-support-shift-select t
        ring-bell-function (quote ignore)
        split-width-threshold 100
        )
  
  
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
  
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (set-language-environment "UTF-8")
#+END_SRC

#+RESULTS:
: t



* UX
** navigation
   #+BEGIN_SRC emacs-lisp :tangle yes

                              (use-package helm
                                :config (helm-mode +1)
                                :bind (("M-x"   . helm-M-x)
                                       ([f3] . helm-buffers-list)       
                                       ("<Hangul> x" . helm-M-x)
                                       ([f9] . helm-occur )
                                       ))
                              (use-package projectile
                                :config
                                (projectile-mode +1))

                              (use-package helm-projectile
                                :bind    ([f5] . helm-projectile))

                              (use-package bufler
                                :custom
                                (bufler-column-name-width 70)
                                (bufler-filter-buffer-modes nil))

                              (setq org-special-ctrl-a/e (quote (t . t)))

                              (add-hook 'bufler-list-mode-hook
                                        (lambda ()
                                          (visual-line-mode -1)
                                          (toggle-truncate-lines 1)))

      ;                   (use-package ace-jump-mode)
     ;                             (global-set-key (kbd "M-z") 'ace-jump-mode)
          (global-unset-key (kbd "C-z"))
               (global-set-key (kbd "C-z") 'ace-jump-helm-line)
     (global-unset-key (kbd "C-v"))
     (setq tab-bar-mode nil)
       #+END_SRC

       #+RESULTS:

** deft

#+begin_src emacs-lisp :tangle yes
  (use-package deft
    :ensure t
    :bind
    ([f8] . deft))
  (setq deft-directory "c:/Users/byoon/Dropbox (Personal)/Zettelkasten/"
        deft-default-extension "org"
        deft-time-format " %b-%Y %H:%M"
        deft-use-filename-as-title t
        deft-new-file-format "%Y%b%d"
        deft-text-mode 'org-mode
        deft-recursive t
        deft-extensions '("org" "txt" "emacs" "bib" "ledger" "el" "tex")
        deft-auto-save-interval 15.0
        deft-file-naming-rules '((noslash . "-")
                                 (nospace . "-")
                                 (case-fn . downcase))) 
  
  
  
  (add-hook 'after-init-hook 'deft)
  (add-hook 'deft-mode-hook #'visual-line-mode)
    (global-set-key (kbd "M-o") 'other-window)
  
  
#+end_src

#+RESULTS:
: other-window

** functionality
#+BEGIN_SRC emacs-lisp  :tangle yes
    (use-package s)
    (use-package org
      :ensure org-plus-contrib)
    (use-package unkillable-scratch
      :config
      (unkillable-scratch 1))


    (use-package aggressive-indent
      :custom (global-aggressive-indent-mode t)
      )

    ;;(straight-use-package '(org-plus-contrib :includes org))


    (setq org-modules
          (quote
          (ol-bibtex ol-docview ol-eww org-habit org-id org-inlinetask org-protocol org-tempo ol-w3m org-annotate-file ol-bookmark org-checklist org-collector org-depend org-invoice org-notify org-registry)))


  (defun kdm/html2org-clipboard ()
    "Convert clipboard contents from HTML to Org and then paste (yank)."
    (interactive)
    (kill-new (shell-command-to-string "xclip -o -t text/html | pandoc -f html -t json | pandoc -f json -t org --wrap=none"
))
    (yank))



      (use-package smartparens
        :ensure t
        :defer t
        :init
        (show-smartparens-global-mode 1))
      (smartparens-global-mode 1)
      (setq show-paren-style 'expression)

      (sp-local-pair 'org-mode "/" "/" :actions '(wrap))
      (sp-local-pair 'org-mode "_" "_" :actions '(wrap))
      (sp-local-pair 'org-mode "*" "*" :actions '(wrap))
      (sp-local-pair 'org-mode "+" "+" :actions '(wrap))
      (sp-local-pair 'org-mode "~" "~" :actions '(wrap))
      (sp-local-pair 'org-mode "=" "=" :actions '(wrap))
      (sp-local-pair 'org-mode "-" "-" :actions '(wrap))
      (sp-pair "'" nil :actions :rem)

#+END_SRC

** org-keybindings
#+BEGIN_SRC emacs-lisp :tangle yes
    (global-set-key (kbd "C-c C-x C-o") 'org-clock-out)
    (global-set-key (kbd "C-c <f2>") 'org-clock-out)
(global-set-key (kbd "C-c c") 'kill-ring-save)
    (global-set-key (kbd "<f1>") 'org-capture)
    (global-set-key (kbd "C-c C-x C-j") 'org-clock-goto)
    (define-key org-mode-map (kbd "C-a") 'org-beginning-of-line)
    (define-key org-mode-map (kbd "C-e") 'org-end-of-line)
    (bind-keys
  ("C-c r" . org-clock-report)
     ("C-c l" . org-store-link)
     ("C-c C-l" . org-insert-link)
     ("C-c b" . list-bookmarks)
     ("C-a" . org-beginning-of-line) 
     ("C-e" . end-of-line) 
     ("C-k" . org-kill-line)
     ("C-."   . org-todo)
     ("C-x /" . shrink-window-horizontally)
     ("C-x ." . org-archive-subtree-default)

     ([f1] . org-capture)
     ([f2] . org-clock-in)
     ;;f3 is helm
     ([f4] . org-refile)
     ;;f5 is projectile
     ([f6] . helm-bibtex-with-local-bibliography)
     ([f7] . org-agenda)
     
     ;;f8 is deft
    ; ([f10] . org-tree-to-indirect-buffer)
     ([f11] . org-id-goto)
     ([f12] . bury-buffer)     )


  (global-set-key (kbd "<f10>") (lambda ()
                                (interactive)
                                (let ((current-prefix-arg '(4)))
                                  (call-interactively #'org-tree-to-indirect-buffer))))


#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (let ((current-prefix-arg '(4))) (call-interactively #'org-tree-to-indirect-buffer)) |




** calendar


#+BEGIN_SRC emacs-lisp :tangle yes

  (use-package calfw)
  (use-package calfw-org)
                                          ;   (use-package calfw-gcal)
  (use-package calfw-cal) 
  (setq package-check-signature nil)
                                          ;  (setq org-gcal-down-days '30)
                                          ;for http400 error, open scratch and evaluate (org-gcal-request-token) using C-x C-e


  (defun my-open-calendar ()
    (interactive)
    (cfw:open-calendar-buffer
     :contents-sources
     (list
      (cfw:org-create-source "pale green")  ; orgmode source
                                          ;    (cfw:cal-create-source "light goldenrod") ; diary source
      ))) 
  (add-hook 'cfw:calendar-mode-hook (lambda () (visual-fill-column-mode 0)))
                                          ;   (setq calendar-daylight-savings-starts '(3 11 year))
                                          ;  (setq calendar-daylight-savings-ends: '(11 4 year))
  (setq calendar-week-start-day 1)

  (setq diary-file "~/Dropbox/Zettelkasten/diary")



  (use-package org-gcal)
  (setq org-gcal-client-id "217294084435-7e5idjaji94bamhu6n5mnchamfl5it6r.apps.googleusercontent.com"
        org-gcal-client-secret "OlIZFIll-Md3n6NxVkpSWr-3"
        org-gcal-fetch-file-alist '(
      ("betsy.yoon@gmail.com" . "~/Dropbox/Zettelkasten/events.org" )
;      ("ua08veaq1ei5a9li8s2tiiecbg@group.calendar.google.com" . "~/Dropbox/Zettelkasten/time.org")
      ))

  (setq org-gcal-recurring-events-mode 'top-level)


#+end_src

** backup
#+begin_src emacs-lisp :tangle yes
  
    (setq backup-directory-alist '(("." . "c:/Users/byoon/Dropbox (Personal)/emacs/baruch-backups"))
        backup-by-copying 1
        delete-old-versions -1
        version-control t
        vc-make-backup-files t)
  (setq auto-save-file-name-transforms '((".*" "c:/Users/byoon/Dropbox (Personal)/emacs/baruch-backups/auto-save-list/" t)))
#+end_src

#+RESULTS:
| .* | c:/Users/byoon/Dropbox (Personal)/emacs/baruch-backups/auto-save-list/ | t |

* UI

  #+BEGIN_SRC emacs-lisp  :tangle yes
    
       (setq org-startup-indented t
            org-hide-emphasis-markers t
            org-startup-folded t
            org-ellipsis " ↯ "
            org-hide-leading-stars t)
      (use-package doom-themes
        :config
        ;; Global settings (defaults)
        (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
              doom-themes-enable-italic t) ; if nil, italics is universally disabled
        (load-theme 'doom-one t)
        ;; Corrects (and improves) org-mode's native fontification.
        (doom-themes-org-config)
        )
    (visual-line-mode 1)
     
    (use-package unicode-fonts)
      (setq org-tags-column 0)
      
    (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (set-file-name-coding-system 'utf-8)
  (set-clipboard-coding-system 'utf-8)
  (set-buffer-file-coding-system 'utf-8) 
#+END_SRC

#+RESULTS:
