baruch_config.el
(set-fringe-mode '(25 . 25))
(fset 'yes-or-no-p 'y-or-n-p)
                                        ;  (setq confirm-kill-emacs (quote y-or-n-p))
(setq confirm-kill-emacs nil
      visible-bell nil
      inhibit-startup-screen t
      org-support-shift-select t
      ring-bell-function (quote ignore)
      split-width-threshold 100
      )


(add-to-list 'default-frame-alist '(fullscreen . maximized))

(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(set-language-environment "UTF-8")

(use-package helm
                           :config (helm-mode +1)
                           :bind (("M-x"   . helm-M-x)
                                  ([f3] . helm-buffers-list)       
                                  ("<Hangul> x" . helm-M-x)
                                  ([f9] . helm-occur )
                                  ))
                         (use-package projectile
                           :config
                           (projectile-mode +1))

                         (use-package helm-projectile
                           :bind    ([f5] . helm-projectile))

                         (use-package bufler
                           :custom
                           (bufler-column-name-width 70)
                           (bufler-filter-buffer-modes nil))

                         (setq org-special-ctrl-a/e (quote (t . t)))

                         (add-hook 'bufler-list-mode-hook
                                   (lambda ()
                                     (visual-line-mode -1)
                                     (toggle-truncate-lines 1)))

                    (use-package ace-jump-mode)
                             (global-set-key (kbd "M-z") 'ace-jump-mode)
     (global-unset-key (kbd "C-z"))
          (global-set-key (kbd "C-z") 'ace-jump-helm-line)
(setq tab-bar-mode nil)

(use-package deft
  :ensure t
  :bind
  ([f8] . deft))
(setq deft-directory "c:/Users/eyoon/Dropbox (Personal)/Zettelkasten/"
      deft-default-extension "org"
      deft-time-format " %b-%Y %H:%M"
      deft-use-filename-as-title t
      deft-new-file-format "%Y%b%d"
      deft-text-mode 'org-mode
      deft-recursive t
      deft-extensions '("org" "txt" "emacs" "bib" "ledger" "el" "tex")
      deft-auto-save-interval 15.0
      deft-file-naming-rules '((noslash . "-")
                               (nospace . "-")
                               (case-fn . downcase))) 



(add-hook 'after-init-hook 'deft)
(add-hook 'deft-mode-hook #'visual-line-mode)

(use-package s)
    (use-package org
      :ensure org-plus-contrib)
    (use-package unkillable-scratch
      :config
      (unkillable-scratch 1))


    (use-package aggressive-indent
      :custom (global-aggressive-indent-mode t)
      )

    ;;(straight-use-package '(org-plus-contrib :includes org))


    (setq org-modules
          (quote
          (ol-bibtex ol-docview ol-eww org-habit org-id org-inlinetask org-protocol org-tempo ol-w3m org-annotate-file ol-bookmark org-checklist org-collector org-depend org-invoice org-notify org-registry)))


  (defun kdm/html2org-clipboard ()
    "Convert clipboard contents from HTML to Org and then paste (yank)."
    (interactive)
    (kill-new (shell-command-to-string "xclip -o -t text/html | pandoc -f html -t json | pandoc -f json -t org --wrap=none"
))
    (yank))



      (use-package smartparens
        :ensure t
        :defer t
        :init
        (show-smartparens-global-mode 1))
      (smartparens-global-mode 1)
      (setq show-paren-style 'expression)

      (sp-local-pair 'org-mode "/" "/" :actions '(wrap))
      (sp-local-pair 'org-mode "_" "_" :actions '(wrap))
      (sp-local-pair 'org-mode "*" "*" :actions '(wrap))
      (sp-local-pair 'org-mode "+" "+" :actions '(wrap))
      (sp-local-pair 'org-mode "~" "~" :actions '(wrap))
      (sp-local-pair 'org-mode "=" "=" :actions '(wrap))
      (sp-local-pair 'org-mode "-" "-" :actions '(wrap))
      (sp-pair "'" nil :actions :rem)

(global-set-key (kbd "C-c C-x C-o") 'org-clock-out)
  (global-set-key (kbd "C-c <f2>") 'org-clock-out)

  (global-set-key (kbd "<f1>") 'org-capture)
  (global-set-key (kbd "C-c C-x C-j") 'org-clock-goto)
  (define-key org-mode-map (kbd "C-a") 'org-beginning-of-line)
  (define-key org-mode-map (kbd "C-e") 'org-end-of-line)
  (bind-keys
("C-c r" . org-clock-report)
   ("C-c l" . org-store-link)
   ("C-c C-l" . org-insert-link)
   ("C-c b" . list-bookmarks)
   ("C-a" . org-beginning-of-line) 
   ("C-e" . end-of-line) 
   ("C-k" . org-kill-line)
   ("C-."   . org-todo)
   ("C-x /" . shrink-window-horizontally)
   ("C-x ." . org-archive-subtree-default)

   ([f1] . org-capture)
   ([f2] . org-clock-in)
   ;;f3 is helm
   ([f4] . org-refile)
   ;;f5 is projectile
   ([f6] . helm-bibtex-with-local-bibliography)
   ([f7] . org-agenda)
   ;;f8 is deft
  ; ([f10] . org-tree-to-indirect-buffer)
   ([f11] . org-id-goto)
   ([f12] . bury-buffer)     )


(global-set-key (kbd "<f10>") (lambda ()
                              (interactive)
                              (let ((current-prefix-arg '(4)))
                                (call-interactively #'org-tree-to-indirect-buffer))))

(setq org-startup-indented t
        org-hide-emphasis-markers t
        org-startup-folded t
        org-ellipsis " [...] "
        org-hide-leading-stars t)
  (use-package doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-one t)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config)
    )
(visual-line-mode 1)
 
(use-package unicode-fonts)
  (setq org-tags-column 0)
