baruch_config.el

(setq-default mode-line-format '("%e"  mode-line-front-space
                                 mode-line-mule-info
                                   mode-line-modified
                                   mode-line-misc-info 
                                   mode-line-remote mode-line-frame-identification mode-line-buffer-identification "   " mode-line-position
  (vc-mode vc-mode)
  "  " mode-line-modes  mode-line-end-spaces)
              )
  (display-time-mode 1)

(use-package yasnippet)
    
          (defhydra hydra-yasnippet (:color red :hint nil)
            "
                           ^YASnippets^
             --------------------------------------------
               Modes:    Load/Visit:    Actions:
    
              _g_lobal  _d_irectory    _i_nsert
              _m_inor   _f_ile         _t_ryout
              _e_xtra   _l_ist         _n_ew
                       reload _a_ll
             "
            ("n" down "done")
            ("p" down "up")
            ("N" outline-next-visible-heading "next heading")
            ("P" outline-previous-visible-heading "prev heading")
            ("d" yas-load-directory)
            ("e" yas-activate-extra-mode)
            ("i" yas-insert-snippet)
            ("f" yas-visit-snippet-file :color blue)
            ("n" yas-new-snippet)
            ("t" yas-tryout-snippet)
            ("l" yas-describe-tables)
            ("g" yas-global-mode :color red)
            ("m" yas-minor-mode :color red)
            ("a" yas-reload-all))
    
    
    (eval-after-load "yas"
    '(progn
      ;; The following is optional.
  (define-key yas-minor-mode-map [backtab]     'yas-expand)
  
  ;; Strangely, just redefining one of the variations below won't work.
  ;; All rebinds seem to be needed.
  (define-key yas-minor-mode-map [(tab)]        nil)
  (define-key yas-minor-mode-map (kbd "TAB")    nil)
  (define-key yas-minor-mode-map (kbd "<tab>")  nil)
))

(setq org-directory "c:/Users/eyoon/Dropbox (Personal)/Zettelkasten/"
      org-default-notes-file "c:/Users/eyoon/Dropbox (Personal)/Zettelkasten/inbox.org"
      org-archive-location "c:/Users/eyoon/Dropbox (Personal)/Zettelkasten/journal.org::datetree/"
      org-contacts-files (quote ("c:/Users/eyoon/Dropbox (Personal)/Zettelkasten/contacts.org"))
      org-roam-directory "c:/Users/eyoon/Dropbox (Personal)/Zettelkasten/Zettels/"
      )
(setq org-archive-reversed-order nil
      org-reverse-note-order t
      org-refile-use-cache t
      org-refile-allow-creating-parent-nodes 'confirm
      org-refile-use-outline-path 'file
      org-refile-targets '((org-agenda-files :maxlevel . 3))
      org-outline-path-complete-in-steps nil
      )


(defun my-org-refile-cache-clear ()
  (interactive)
  (org-refile-cache-clear))
(define-key org-mode-map (kbd "C-0 C-c C-w") 'my-org-refile-cache-clear)




                                        ; Refile in a single go

                                        ;  (global-set-key (kbd "<f4>") 'org-refile)


(setq org-id-link-to-org-use-id t
      org-id-method (quote org)
      org-return-follows-link t
      org-link-keep-stored-after-insertion nil
      org-goto-interface (quote outline-path-completion)
      org-clock-mode-line-total 'current)

                                        ;   (add-hook 'org-mode-hook (lambda () (org-sticky-header-mode 1)))


(setq global-visible-mark-mode t)

(setq org-agenda-overriding-columns-format "%40ITEM %SCHEDULED %DEADLINE ")


(setq org-agenda-prefix-format
      '((agenda . " %i %-12:c%?-12t% s")
	(todo . " %i %-12:c")
	(tags . " %i %-12:c")
	(search . " %i %-12:c")))

(setq org-agenda-with-colors t
      org-agenda-start-on-weekday nil  ;; this allows agenda to start on current day
      org-agenda-current-time-string "****"
      org-agenda-start-with-clockreport-mode t
      org-agenda-dim-blocked-tasks t
      org-agenda-window-setup 'only-window
      )


;;skips
(setq org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t
      org-agenda-skip-timestamp-if-done t
      org-agenda-skip-deadline-prewarning-if-scheduled t
      )

(setq org-agenda-clockreport-parameter-plist
      (quote
       (:link t :maxlevel 4 :narrow 30 :tags t :tcolumns 1 :indent t :hidefiles t :fileskip0 t)))
