baruch_config.org
** org-super-agenda
#+begin_src emacs-lisp :tangle yes :results none
    (use-package org-super-agenda)
    (org-super-agenda-mode 1)
    (setq org-super-agenda-mode 1)
    (setq org-agenda-custom-commands
          '(
            ("l" . "just todo lists") ;description for "l" prefix
            ("lt" tags-todo "untagged todos" "-{.*}")
            ("ls" alltodo "all unscheduled" (
                                             (org-agenda-todo-ignore-scheduled t)
                                             (org-super-agenda-groups
                                              '(
                       (:discard (:todo "HABIT"))
                                                                                                           ;   (:name "leadership" :and (:tag "lc"))
                                                                                                            ;  (:name "tongsol" :and (:tag "tongsol"))
                                                                                                             ; (:name "keep" :and (:tag "keep"))
                                                                                                            ;  (:name "archives" :and (:tag "archives"))
                                                                                                              (:name "ndd" :and (:tag "ndd"))
                                                                                                     ;         (:name "scholarship" :and (:tag "schol"))
                                                                                                              (:name "baruch scholarship" :and (:tag "baruch" :tag "scholarship"))
                                                                                                              (:name "baruch librarianship" :and (:tag "baruch" :tag "librarianship"))
                                                                                                              (:name "baruch tenure" :and (:tag "baruch" :tag "tenure"))
                                                                                                              
                                                                                                              (:name "baruch service" :and (:tag "baruch" :tag "service"))
                                                                                                              (:name "baruch" :and (:tag "baruch"))
                                                                                                              (:name "finances" :and (:tag "finances"))
                                                                                                              (:name "health" :and (:tag "health"))
                                                                                                              (:name "home" :and (:tag "home"))
                                                                                                              (:name "admin" :and (:tag "sysadmin")) 
                                                ))
  
                                             (org-agenda-skip-function
                                              '(org-agenda-skip-entry-if 'todo '("습관" "HOLD"  "PROJ" "AREA")) )
                                             ))
            ("lx" "With deadline columns" alltodo "" 
             ((org-agenda-overriding-columns-format "%40ITEM %SCHEDULED %DEADLINE %EFFORT " )
              (org-agenda-view-columns-initially t)
              (org-agenda-sorting-strategy '(timestamp-up))
              (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '("습관" "HOLD" "WAIT" )) ) )      )
            ("la" "all todos" ((alltodo "" ((org-agenda-overriding-header "")
                                            (org-super-agenda-groups
                                             '(
                                               (:discard (:todo "HABIT"))
                                               (:name "TO READ" :and (:tag "read"))
                                               (:name "Meetings" :and (:tag "meetings"))
                                               (:name "TO WRITE" :and (:tag "write"))
                                               (:name "TO PROCESS" :and (:tag "process"))
                                               (:name "look up" :and (:tag "lookup"))
                                               (:name "focus" :and (:tag "focus"))
                                               (:name "quick" :and (:tag "quick"))
  
                                               (:name "away from computer" :and (:tag "analog"))
  
  
  
                                               ))))))
  
  
            ("g" "all UNSCHEDULED NEXT|TODAY|IN-PROG"
             ((agenda "" ((org-agenda-span 2)
                          (org-agenda-clockreport-mode nil)))
              (todo "NEXT|TODAY|IN-PROG"))
             ((org-agenda-todo-ignore-scheduled t)))
  
            ("z" "super agenda" ((agenda "" ((org-agenda-span 'day)
                                             (org-super-agenda-groups
                                              '((:name "Day" :time-grid t :order 1)))))
                                 (alltodo "" ((org-agenda-overriding-header "")
                                              (org-super-agenda-groups '(
                       (:discard (:todo "HABIT"))
                                                                                                           ;   (:name "leadership" :and (:tag "lc"))
                                                                                                            ;  (:name "tongsol" :and (:tag "tongsol"))
                                                                                                              ; (:name "keep" :and (:tag "keep"))
                                                                                                            ;  (:name "archives" :and (:tag "archives"))
                                                                                                              (:name "ndd" :and (:tag "ndd"))
                                                                                                     ;         (:name "scholarship" :and (:tag "schol"))
                                                                                                              (:name "baruch scholarship" :and (:tag "baruch" :tag "scholarship"))
                                                                                                              (:name "baruch librarianship" :and (:tag "baruch" :tag "librarianship"))
                                                                                                              (:name "baruch tenure" :and (:tag "baruch" :tag "tenure"))
                                                                                                              
                                                                                                              (:name "baruch service" :and (:tag "baruch" :tag "service"))
                                                                                                              (:name "baruch" :and (:tag "baruch"))
                                                                                                              (:name "finances" :and (:tag "finances"))
                                                                                                              (:name "health" :and (:tag "health"))
                                                                                                              (:name "home" :and (:tag "home"))
                                                                                                              (:name "admin" :and (:tag "sysadmin")) 
  
                                               )))))
             ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '("습관" "HOLD"  "AREA")) )
              (org-agenda-todo-ignore-scheduled t) )
             nil ("c:/Users/byoon/Dropbox (Personal)/Zettelkasten/agenda.html"))
  )
  
          )
            #+end_src

#+RESULTS:
| z | super | ((agenda  ((org-agenda-span 'day) (org-super-agenda-groups '((:name Today :time-grid t :date today :todo TODAY :scheduled today :order 1))))) (alltodo  ((org-agenda-overriding-header ) (org-super-agenda-groups 'nil)))) |

(setq org-super-agenda-groups
'(
         

))

(:name "Waiting"
:todo "WAIT" )
(:name "Next Items"
:time-grid t
:todo "NEXT")
#+RESULTS:
: 1
** org-agenda-export
#+begin_src emacs-lisp :tangle yes
  
  (setq org-agenda-exporter-settings
      '((ps-number-of-columns 2)
        (ps-landscape-mode t)
        (org-agenda-add-entry-text-maxlines 5)
        (htmlize-output-type 'css)))
#+end_src

#+RESULTS:
| ps-number-of-columns               |    2 |
| ps-landscape-mode                  |    t |
| org-agenda-add-entry-text-maxlines |    5 |
| htmlize-output-type                | 'css |

** org-todo
#+begin_src emacs-lisp :tangle yes :results none
  (setq org-enforce-todo-dependencies t
        org-clock-out-when-done t
        )

  (setq org-log-into-drawer t)

  (setq org-todo-keywords
        (quote
         ((sequence "TODO(t)" "NEXT(n)" "IN-PROG(i)" "|" "DONE(d)"  "x(c)" )
          (type    "HABIT(h)" "PROJ(p)"  "WAIT(w)" "|" "DONE(d)")     )))

  (setq org-todo-keyword-faces
        '(("WAIT" :weight regular :underline nil :inherit org-todo :foreground "yellow")
                                          ;          ("TODO" :weight regular :underline nil :inherit org-todo :foreground "#89da59")
          ("TODO" :weight regular :underline nil :inherit org-todo )
          ("NEXT" :weight regular :underline nil :inherit org-todo :foreground "#c7d800")
          ("IN-PROG" :weight bold :underline nil :inherit org-todo :foreground "#fa4032")
           ("HABIT" :weight bold :underline nil :inherit org-todo :foreground "forestgreen")
          ("PROJ" :foreground "magenta")
          ("HOLD" :weight bold :underline nil :inherit org-todo :foreground "#336b87")))


  (use-package org-edna)
  (org-edna-mode 1)
  (setq org-log-done 'time)

#+end_src
** org-tag
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-tag-alist '(
                              (:startgroup . nil)
                        ("ndd" . ?n)
                        ("health" . ?m)
                        ("baruch" . ?b)
                        ("finances" . ?i)
                        ("sysadmin" . ?y)
                        ("home" . ?h)
                        (:endgroup . nil)

                        (:startgroup . nil)
                        ("lc" . ?e)
                        ("tongsol" . ?g)
                        ("keep" . ?k)
                        ("archives" . ?v) 
                        (:endgroup . nil)

                        (:startgroup . nil)
                        ("librarianship" . ?l)
                        ("service" . ?v)
                        ("scholarship" . ?s)
                        ("tenure" . ?t)
                        (:endgroup . nil)

))

  (setq org-complete-tags-always-offer-all-agenda-tags nil)
  (setq org-tags-column 0)

#+END_SRC

#+RESULTS:
: 0

#+begin_src emacs-lisp :tangle no
    (setq org-tag-alist '(  ("NOW" . ?n) ("workflow" . ?w)
                        (:startgroup . nil)
                        ("SHALLOW" . ?s) ("DEEP" . ?d) ("HOME" . ?h) 
                        (:endgroup . nil)
                        (:startgroup . nil)
                        ("#necessary" . ?c) ("#wouldbenice" . ?b)
                        (:endgroup . nil)
                        (:startgroup . nil)
                        ("@timely". ?t) ("@nottimely" . ?e)
                        (:endgroup . nil)
                       
                        ))
  
#+end_src
#+RESULTS:
: 0

** org-capture
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-capture-templates
        '(
          ("a" "current activity" entry (file+olp+datetree "c:/Users/byoon/Dropbox (Personal)/Zettelkasten/journal.org") "** %? \n" :clock-in t :clock-keep t :kill-buffer nil )
  
          ("b" "current activity" entry (file+olp+datetree "c:/Users/byoon/Dropbox (Personal)/Zettelkasten/baruch.org") "** %? \n" :clock-in t :clock-keep t :kill-buffer nil )
         
  
            ("c" "calendar" entry (file+headline "c:/Users/byoon/Dropbox (Personal)/Zettelkasten/inbox.org" "Events") "** %^{EVENT}\n%^t\n%a\n%?")
  
          ("e" "emacs log" item (id "config") "%U %a %?" :prepend t) 
  
          ("f" "Anki basic" entry (file+headline "c:/Users/byoon/Dropbox (Personal)/Zettelkasten/anki.org" "Dispatch Shelf") "* %<%H:%M>   \n:PROPERTIES:\n:ANKI_NOTE_TYPE: Basic (and reversed card)\n:ANKI_DECK: Default\n:END:\n** Front\n%^{Front}\n** Back\n%^{Back}%?")
  
          ("F" "Anki cloze" entry (file+headline "c:/Users/byoon/Dropbox (Personal)/Zettelkasten/anki.org" "Dispatch Shelf") "* %<%H:%M>   \n:PROPERTIES:\n:ANKI_NOTE_TYPE: Cloze\n:ANKI_DECK: Default\n:END:\n** Text\n%^{Front}%?\n** Extra")
  
          ("j" "journal" entry (file+olp+datetree "c:/Users/byoon/Dropbox (Personal)/Zettelkasten/journal.org") "** journal :journal: \n%U  \n%?\n\n"   :clock-in t :clock-resume t :clock-keep nil :kill-buffer nil :append t) 
  
          ("t" "todo" entry (file "c:/Users/byoon/Dropbox (Personal)/Zettelkasten/inbox.org") "* TODO %? \nSCHEDULED: %t\n%a\n" :prepend nil)
  
          ("w" "org-protocol" entry (file "c:/Users/byoon/Dropbox (Personal)/Zettelkasten/inbox.org")
           "* %a \nSCHEDULED: %t %?\n%:initial" )
          ("x" "org-protocol" entry (file "c:/Users/byoon/Dropbox (Personal)/Zettelkasten/inbox.org")
           "* TODO %? \nSCHEDULED: %t\n%a\n\n%:initial" )
          ("p" "org-protocol" table-line (id "pens")
           "|%^{Pen}|%A|%^{Price}|%U|" )
  
          ("y" "org-protocol" item (id "resources")
           "[ ] %a %U %:initial" )
  
          ))
  
  
  
#+END_SRC

#+RESULTS:
| a         | current activity | entry       | (file+olp+datetree c:/Users/byoon/Dropbox (Personal)/Zettelkasten/journal.org)  | ** %?        |     |
| :clock-in | t                | :clock-keep | t                                                                               | :kill-buffer | nil |
| b         | current activity | entry       | (file+olp+datetree c:/Users/byoon/Dropbox (Personal)/Zettelkasten/baruch.org)   | ** %?        |     |
| :clock-in | t                | :clock-keep | t                                                                               | :kill-buffer | nil |
| c         | calendar         | entry       | (file+headline c:/Users/byoon/Dropbox (Personal)/Zettelkasten/inbox.org Events) | ** %^{EVENT} |     |

removed templates:
- ("d" "download" table-line (id "reading") "|%^{Author} | %^{Title} | %^{Format}|"  )
- ("l" "look up" item (id "5br4n6815pi0") "[ ] %? %U %a" :prepend nil)
- ("s" "to buy" item (id "shopping") "[ ] %?" :prepend t)
- ("z" "zettel" entry (file "~/Dropbox (Personal)/Zettelkasten/zettels.org") "* %^{TOPIC}\n%U\n %? \n%a\n\n\n" :prepend nil :unarrowed t)
-           ("m" "meditation" table-line (id "meditation") "|%u | %^{Time} | %^{Notes}|" :table-line-pos "II-1" )





(use-package org-plus-contrib)
#+RESULTS:
** org-clock

*** org-mru

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-mru-clock
    :bind     ("M-<f2>" . org-mru-clock-in)
    :config
    (setq org-mru-clock-how-many 80)
    (setq org-mru-clock-keep-formatting t)
    (setq org-mru-clock-completing-read 'helm--completing-read-default)
    )

  (setq org-clock-mode-line-total 'current)

#+END_SRC


